In [1]:
import pandas as pd
import numpy as np

In [3]:
s = pd.Series(np.random.randn(10),
             index=[["a","a","a","b","b","b","c","c","d","d"],
                    [1,2,3,1,2,3,1,2,2,3]])

In [4]:
s

a  1   -1.970356
   2   -0.656101
   3    1.269690
b  1    1.937491
   2    0.479004
   3   -0.176804
c  1   -0.512932
   2    1.809837
d  2    1.089504
   3    0.150171
dtype: float64

In [5]:
s.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [6]:
s["b"]

1    1.937491
2    0.479004
3   -0.176804
dtype: float64

In [7]:
s["b":"c"]

b  1    1.937491
   2    0.479004
   3   -0.176804
c  1   -0.512932
   2    1.809837
dtype: float64

In [8]:
s[("b",3)]

-0.17680421010268832

In [9]:
s[:,2] # 모든 첫번째 index에서 2 index 값 출력

a   -0.656101
b    0.479004
c    1.809837
d    1.089504
dtype: float64

In [12]:
df = pd.DataFrame(np.arange(12).reshape((4,3)),
                  index = [["a","a","b","b"],
                           [1,2,1,2]],
                  columns=[["Seoul", "Seoul", "Busan"],
                          ["Green", "Red", "Green"]])

In [13]:
df

    Seoul     Busan
    Green Red Green
a 1     0   1     2
  2     3   4     5
b 1     6   7     8
  2     9  10    11

In [14]:
df.index.names = ["key1","key2"]

In [15]:
df

          Seoul     Busan
          Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [16]:
df.columns.names = ["city","color"]

In [17]:
df

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [18]:
df["Seoul"]

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [19]:
df[("Seoul", "Green")]

key1  key2
a     1       0
      2       3
b     1       6
      2       9
Name: (Seoul, Green), dtype: int32

In [22]:
df.loc["a"]

city  Seoul     Busan
color Green Red Green
key2
1         0   1     2
2         3   4     5

In [23]:
df.loc[("a",1)]

city   color
Seoul  Green    0
       Red      1
Busan  Green    2
Name: (a, 1), dtype: int32

In [24]:
df.loc["b", ("Seoul","Red")]

key2
1     7
2    10
Name: (Seoul, Red), dtype: int32

In [25]:
df.sort_index()

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [26]:
df

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [27]:
df.sort_index(axis=0, level=0)

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [28]:
df.sort_index(axis=0, level=1) # 2번째 index 기준으로 정렬하겟다

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
b    1        6   7     8
a    2        3   4     5
b    2        9  10    11

In [29]:
df.sort_index(axis=0, level="key2")

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
b    1        6   7     8
a    2        3   4     5
b    2        9  10    11

In [30]:
df.sort_index(axis=1, level=1) # column으로 정렬, 2번째 level기준으로 정렬

city      Busan Seoul
color     Green Green Red
key1 key2
a    1        2     0   1
     2        5     3   4
b    1        8     6   7
     2       11     9  10

In [31]:
df.sort_values(by=("Busan","Green"))

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [37]:
df.sum(axis=0, level=0)

city  Seoul     Busan
color Green Red Green
key1
a         3   5     7
b        15  17    19

In [38]:
df.sum(axis=0, level=1)

city  Seoul     Busan
color Green Red Green
key2
1         6   8    10
2        12  14    16

In [39]:
df2 = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                    'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                    'd': [0, 1, 2, 0, 1, 2, 3]})

In [40]:
df2

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [42]:
df3 = df2.set_index(["c","d"])

In [43]:
df3

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [45]:
df2.set_index(["c","d"], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [48]:
df3.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [49]:
df4 = pd.DataFrame(np.arange(6).reshape((2, 3)),
                   index=['Seoul', 'Busan'], 
                   columns=['one', 'two', 'three'])
df4.index.name = "city"
df4.columns.name = "number"

In [50]:
df4

number  one  two  three
city
Seoul     0    1      2
Busan     3    4      5

In [61]:
df5 = df4.stack() # set_index는 기존의 index를 새로 대체하면서, 지정한 열이 가질 수 있는 값들이 index가 됨
            # stack은 현재 열의 이름, 즉 column 자체가 현재 index의 최하위 index로 붙게 됨

In [52]:
df4.stack().unstack() # = unstack(level=1)

number  one  two  three
city
Seoul     0    1      2
Busan     3    4      5

In [53]:
df4.stack().unstack(level=0)

city    Seoul  Busan
number
one         0      3
two         1      4
three       2      5

In [54]:
df4.stack().unstack(level="city")

city    Seoul  Busan
number
one         0      3
two         1      4
three       2      5

In [55]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
s3 = pd.concat([s1, s2], keys=["one", "two"])

In [56]:
s1

a    0
b    1
c    2
d    3
dtype: int64

In [57]:
s2

c    4
d    5
e    6
dtype: int64

In [58]:
s3

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [59]:
s3.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [70]:
df6 = pd.DataFrame({"left": df5, "right": df5 + 5},
                   columns=["left", "right"])
df6.columns.name = "side"

In [71]:
df6

side          left  right
city  number
Seoul one        0      5
      two        1      6
      three      2      7
Busan one        3      8
      two        4      9
      three      5     10

In [72]:
df6.unstack() # index의 최하위가 column의 최하위로 이동

side   left           right
number  one two three   one two three
city
Seoul     0   1     2     5   6     7
Busan     3   4     5     8   9    10

In [73]:
df6.unstack(level="city") # city index가 column의 최하위로

side    left       right
city   Seoul Busan Seoul Busan
number
one        0     3     5     8
two        1     4     6     9
three      2     5     7    10

In [75]:
df6.unstack(level="city").stack(level="side") # stack은 column을 index로 unstack은 index를 column으로

city          Busan  Seoul
number side
one    left       3      0
       right      8      5
two    left       4      1
       right      9      6
three  left       5      2
       right     10      7